# FabricationStraigtLengthOversized Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationStraigtLengthOversized Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Fabrication straight exceeds the standard length. Use the Optimize Length command to adjust the length.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationStraigtLengthOversized { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationStraigtLengthOversized As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationStraigtLengthOversized {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace